app/views/users/show.html.erb

          <div class="comments-likes">
          <small>Comments: <%= post.comments.size %></small>
          <small>Likes: <%= post.likes.size %></small>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 6]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 6]]