app/views/posts/_post_comments.html.erb

<ul class="comments flex-one">
  <% @post.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 2]]