app/views/posts/index.html.erb

            <div class="counters">
              <span>Comments: <%= post.comments.size %></span>
              <span>Likes: <%= post.likes.size %></span>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 7]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 7]]