app/models/like.rb

  def update_likes_counter
    @posts = Post.all
    @posts.each do |post|
      post.update_column(:likes_counter, post.likes.count) if post.id == post_id
---
SELECT "posts".* FROM "posts"
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 7]]
UPDATE "posts" SET "likes_counter" = $1 WHERE "posts"."id" = $2  [["likes_counter", 9], ["id", 7]]