app/models/post.rb

def update_posts_counter
  @users.each do |user|
    user.update_column(:posts_counter, user.posts.count) if user.id == author_id
---
UPDATE "users" SET "posts_counter" = COALESCE("posts_counter", 0) + $1 WHERE "users"."id" = $2  [["posts_counter", 1], ["id", 1]]